using System;

namespace CbasHome4Task8
{
    internal class Program
    {
        /*Задание 4 

        Зайдите на сайт MSDN. Используя поисковые механизмы MSDN, 
        найдите самостоятельно описание темы по каждому примеру, который был рассмотрен на уроке,
        так, как это представлено ниже, в разделе «Рекомендуемые ресурсы», описания данного урока.
        Сохраните ссылки и дайте им короткое описание.*/


        //DateTime Структура/ 
        //https://learn.microsoft.com/ru-ru/dotnet/api/system.datetime?redirectedfrom=MSDN&view=net-6.0

        //Упаковка-преобразование и распаковка-преобразование /Упаковка/ Распаковка-преобразование

        //https://learn.microsoft.com/ru-ru/dotnet/csharp/programming-guide/types/boxing-and-unboxing?redirectedfrom=MSDN

        //Типы перечислений/Типы перечислений как битовые флаги/ Тип System.Enum и ограничение перечисления//


        ///https://learn.microsoft.com/ru-ru/dotnet/csharp/language-reference/builtin-types/enum?redirectedfrom=MSDN




        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
